integration/src/Catalogs/грТипыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>грТипыОбъектов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АлгоритмОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторШаблона</Name>
					<Comment>Внутренний идентификатор загруженного шаблона</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Включен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

integration/src/InformationRegisters/сшпРепозиторийОбъектовИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>сшпРепозиторийОбъектовИнтеграции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДляУдаленияПроцедураОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцедураОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.сшпМетодХранения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторШаблона</Name>
					<Comment>Внутренний идентификатор загруженного шаблона</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПеременных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяКлассаОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипИнтеграции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.сшпТипыИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

integration/src/InformationRegisters/сшпСтатусыОбработчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>сшпСтатусыОбработчиков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.сшпСтатусыОбработчиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбработчика</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

integration/src/Enums/сшпСтатусыОбработчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>сшпСтатусыОбработчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

integration/src/Enums/сшпТипыИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>сшпТипыИнтеграции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исходящая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Входящая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Функция</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

integration/src/Catalogs/грТипыОбъектов/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьАлгоритмыСборкиИзESB(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьИзESBНаСервереЗавершение", ЭтотОбъект );
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Обновить алгоритмы сборки из ESB?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьИзESBНаСервереЗавершение( Результат, ДопПараметры ) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьИзESBНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ОбновитьИзESBНаСервере()
	
	ИмяНастройки = "ПрефиксОбработчиковСборки";
	ПрефиксКласса = Справочники.грНастройкиПоУмолчанию.ПолучитьЗначениеНастройки( ИмяНастройки );
	
	текЗапрос = Новый Запрос(
	"ВЫБРАТЬ
	|	тбРепозиторий.ИмяКлассаОбъекта КАК Наименование,
	|	тбРепозиторий.ПроцедураОбработки КАК АлгоритмОбработки,
	|	тбРепозиторий.Версия КАК Версия,
	|	тбРепозиторий.ИдентификаторШаблона КАК ИдентификаторШаблона
	|ПОМЕСТИТЬ ВТ_ИсходящиеОбработчики
	|ИЗ
	|	РегистрСведений.сшпРепозиторийОбъектовИнтеграции КАК тбРепозиторий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.сшпСтатусыОбработчиков КАК тбСтатусы
	|		ПО тбРепозиторий.ИдентификаторШаблона = тбСтатусы.ИдентификаторОбработчика
	|			И (тбСтатусы.Статус = ЗНАЧЕНИЕ(Перечисление.сшпСтатусыОбработчиков.Включен))
	|ГДЕ
	|	тбРепозиторий.ИмяКлассаОбъекта ПОДОБНО ""//%1"" + ""%""
	|	И тбРепозиторий.ТипИнтеграции = ЗНАЧЕНИЕ(Перечисление.сшпТипыИнтеграции.Исходящая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(грТипыОбъектов.Ссылка, ЗНАЧЕНИЕ(Справочник.грТипыОбъектов.ПустаяСсылка)) КАК Ссылка,
	|	ВТ_ИсходящиеОбработчики.Наименование КАК Наименование,
	|	ВТ_ИсходящиеОбработчики.АлгоритмОбработки КАК АлгоритмОбработки,
	|	ВТ_ИсходящиеОбработчики.Версия КАК Версия,
	|	ВТ_ИсходящиеОбработчики.ИдентификаторШаблона КАК ИдентификаторШаблона
	|ИЗ
	|	ВТ_ИсходящиеОбработчики КАК ВТ_ИсходящиеОбработчики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.грТипыОбъектов КАК грТипыОбъектов
	|		ПО ВТ_ИсходящиеОбработчики.ИдентификаторШаблона = грТипыОбъектов.ИдентификаторШаблона");	
	
	текЗапрос.Текст = СтрЗаменить( текЗапрос.Текст, "//%1", ПрефиксКласса );
	
	Выборка = текЗапрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено( Выборка.Ссылка ) Тогда
			СпрОбъект = Справочники.грТипыОбъектов.СоздатьЭлемент();
		Иначе
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств( СпрОбъект, Выборка );
		СпрОбъект.Наименование = СтрЗаменить( Выборка.Наименование, ПрефиксКласса, "");
		СпрОбъект.Записать();
		
	КонецЦикла;

КонецПроцедуры;

#КонецОбласти
